#

# Introduction
pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive.

In [14]:
import pandas as pd

In [15]:
df = pd.read_csv("data/users.csv")

In [16]:
df

       Username                   Email    Id First name Last name Active
0      blu3FisH      rachel@example.com  9012     Rachel    Booker    Yes
1     GreenFr0g   laura@yourcompany.com  2070      Laura      Grey    Yes
2      blackd0g   craig@yourcompany.com  4081      Craig   Johnson     No
3     jenkins46        mary@example.com  9346       Mary   Jenkins    Yes
4       smith79       jamie@example.com  5079      Jamie     Smith    Yes
5        john00               js@co.com   303       John     Smith     No
6   BlackTurkey    jhalprin@example.com   304        Jim   Halprin    Yes
7      BlueHawk      tjones@example.com   305     Teresa     Jones    Yes
8     GreenTree    tomjones@example.com   306      Tommy     Jones    Yes
9    OrangeFish  greggjones@example.com   307      Gregg     Jones    Yes
10      RedBoat   dthompson@example.com   308     Daniel  Thompson    Yes

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Username    11 non-null     object
 1   Email       11 non-null     object
 2   Id          11 non-null     int64
 3   First name  11 non-null     object
 4   Last name   11 non-null     object
 5   Active      11 non-null     object
dtypes: int64(1), object(5)
memory usage: 656.0+ bytes

In [18]:
df.shape

(11, 6)

In [19]:
df.columns

Index(['Username', 'Email', 'Id', 'First name', 'Last name', 'Active'], dtype='object')

## Series  
One-dimensional ndarray with axis labels  
(Like a column in the table)

In [21]:
type(df['Username'])

pandas.core.series.Series

### Select Column(s)

In [22]:
df['Username']

0        blu3FisH
1       GreenFr0g
2        blackd0g
3       jenkins46
4         smith79
5          john00
6     BlackTurkey
7        BlueHawk
8       GreenTree
9      OrangeFish
10        RedBoat
Name: Username, dtype: object

### Select Multiple Columns
pass a list as an argument to df index [ [] ]

In [23]:
df[['Email', 'Active']]

                     Email Active
0       rachel@example.com    Yes
1    laura@yourcompany.com    Yes
2    craig@yourcompany.com     No
3         mary@example.com    Yes
4        jamie@example.com    Yes
5                js@co.com     No
6     jhalprin@example.com    Yes
7       tjones@example.com    Yes
8     tomjones@example.com    Yes
9   greggjones@example.com    Yes
10   dthompson@example.com    Yes

### Select Row(s)
i.e, Select first user

In [ ]:
df.loc[0]

Username                blu3FisH
Email         rachel@example.com
Id                          9012
First name                Rachel
Last name                 Booker
Active                       Yes
Name: 0, dtype: object

### Select Row(s) and Column(s)
i.e, What is the email of the first user?

In [25]:
df.loc[[0], ['Email']]

                Email
0  rachel@example.com

### Slicing
Note that when slicing, no braces inside .loc[:,:]

In [27]:
df.loc[:, 'Email']

0         rachel@example.com
1      laura@yourcompany.com
2      craig@yourcompany.com
3           mary@example.com
4          jamie@example.com
5                  js@co.com
6       jhalprin@example.com
7         tjones@example.com
8       tomjones@example.com
9     greggjones@example.com
10     dthompson@example.com
Name: Email, dtype: object

In [29]:
df.loc[:, ['Id','Last name']]

      Id Last name
0   9012    Booker
1   2070      Grey
2   4081   Johnson
3   9346   Jenkins
4   5079     Smith
5    303     Smith
6    304   Halprin
7    305     Jones
8    306     Jones
9    307     Jones
10   308  Thompson

In [26]:
df.loc[:, 'First name':'Active']

   First name Last name Active
0      Rachel    Booker    Yes
1       Laura      Grey    Yes
2       Craig   Johnson     No
3        Mary   Jenkins    Yes
4       Jamie     Smith    Yes
5        John     Smith     No
6         Jim   Halprin    Yes
7      Teresa     Jones    Yes
8       Tommy     Jones    Yes
9       Gregg     Jones    Yes
10     Daniel  Thompson    Yes